puts "Давайте определим порядковый номер вашей даты"
puts "Введите день:"
day = gets.chomp.to_i
puts "Введите название месяца:"
month = gets.chomp.downcase
puts "Введите год:"
year = gets.chomp.to_i
hash_month = { "январь" => 0, "февраль" => 31, "март" => 59, "апрель" => 90,
  "май" => 120,"июнь" => 151, "июль" => 181, "август" => 212, "сентябрь" => 243, "октябрь" => 273, "ноябрь" => 304,"декабрь" => 334}
#Число дней,прошедших от начала года к текущему месяцу
if year % 4 == 0 || year % 400 == 0 #не високосный
  num_month = hash_month[month]
  number = num_month + day
  print number
else year % 100  == 0 #високосный
  hash_month = { "январь" => 0, "февраль" => 31, "март" => 60, "апрель" => 91,
  "май" => 121, "июнь" => 152, "июль" => 182, "август" => 213, "сентябрь" => 244, "октябрь" => 274, "ноябрь" => 305,"декабрь" => 335}
  num_month = hash_month[month]
  if num_month == nil
    print "Проверьте корректность написания месяца"
  end
  number = num_month + day
  print number
end
